TensorFlowFoam/misc/Other_models/ML_KO/KO_Run/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5024";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
20540
(
-1.55331
-1.42631
-1.55331
-1.42631
-1.55331
-1.42631
-1.55331
-1.42631
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
65
(
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
113
(
0.635
0.635
0.635
0.635
0.635
0.635
0.635
0.635
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
218
(
-1.36984
-1.31652
-1.26514
-1.21564
-1.16794
-1.12198
-1.07769
-1.03502
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
266
(
-1.36984
-1.31652
-1.26514
-1.21564
-1.16794
-1.12198
-1.07769
-1.03502
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
