TensorFlowFoam/misc/Other_models/ML_KO/KO_Run/system/sampleCp
type            patchProbes;
libs            ("libsampling.so");
writeControl    writeTime;

patch           lowerWall;
probeLocations  ();
fields          (cp);

